Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The Apicurio Registry 3.x client libraries continue to work with Apicurio Registry 2.x servers. However, note that Apicurio Registry 2.x is no longer actively maintained.
ja_jp: Apicurio Registry 3.x クライアントライブラリーは、引き続き Apicurio Registry 2.x サーバーで動作します。ただし、Apicurio Registry 2.x は現在、積極的にメンテナンスされていません。

source: The Apple OIDC provider uses a `client_secret_post` method whereby a secret is a JWT produced with a `private_key_jwt` authentication method, but with the Apple account-specific issuer and subject claims.
ja_jp: Apple OIDC プロバイダは、 `private_key_jwt` 認証方式で生成された JWT をシークレットとする `client_secret_post` 方式を使用していますが、Apple アカウント固有のissuerとsubjectのクレームを使用しています。

source: The Apple OIDC provider uses a `client_secret_post` method, in which the secret is a JWT produced with a `private_key_jwt` authentication method, but with the Apple account-specific issuer and subject claims.
ja_jp: Apple OIDC プロバイダーは `client_secret_post` メソッドを使用します。この場合、シークレットは `private_key_jwt` 認証メソッドで生成された JWT ですが、Apple アカウント固有の issuer および subject クレームを使用します。

source: The April newsletter has been sent. It's full of great new articles like "Kubernetes Native Java with Quarkus" by Jason Greene, John Clingan and Eric Deandrea. Others include:Develop and Deploy Cloud Native Java Applications at Supersonic speed, Build a REST API from the ground up with Quarkus 2.0, Building Databases on Kubernetes with Quarkus, Insights on Vaadin with Quarkus, Quarkus Tools for Visual Studio Code - 1.10.0 release, Qute Templating Engine Support - Now Available for Quarkus Tools for Visual Studio Code, and Riding Camel Quarkus: effortless APIs. You will also see the lastest Quarkus Insights episodes and upcoming Quarkus attended events.
ja_jp: 4月号のニュースレターが公開されました。Jason Greene、John Clingan、Eric Deandreaによる「Kubernetes Native Java with Quarkus」など、素晴らしい新記事満載です。その他、「Develop and Deploy Cloud Native Java Applications at Supersonic speed」「Build a REST API from the ground up with Quarkus 2.0」「Building Databases on Kubernetes with Quarkus」「Insight on Vaadin with Quarkus」「Quarkus Tools for Visual Studio Code - 1.10.0 release」「Qute Templating Engine Support - now available for Quarkus Tools for Visual Studio Code」「Riding Camel Quarkus: effortless apis」などが掲載されています。また、最新のQuarkus Insightsのエピソードや、Quarkusが参加する予定のイベントもご覧いただけます。

source: The ArC Dev UI now presents a bean dependency graph.
ja_jp: ArC Dev UI はBean依存関係グラフを表示するようになりました。

source: The Artemis JMS solution is located in the `jms-quickstart` link:{quickstarts-tree-url}/jms-quickstart[directory].
ja_jp: Artemis JMS ソリューションは `jms-quickstart` link:{quickstarts-tree-url}/jms-quickstart[ディレクトリ] にあります。

source: The Artemis JMS solution is located in the `jms-quickstart` {quickstarts-tree-url}/jms-quickstart[directory].
ja_jp: Artemis JMS ソリューションは `jms-quickstart` {quickstarts-tree-url}/jms-quickstart[ディレクトリ] にあります。

source: The Asciidoc files can be found in the `src/main/asciidoc` directory within the docs module.
ja_jp: Asciidoc ファイルは docs モジュール内の `src/main/asciidoc` ディレクトリーにあります。

source: The August Newsletter has been published! This month, check out great articles like "3 reasons Quarkus 2.0 improves developer productivity on Linux" and "Bind a cloud event to Knative".
ja_jp: 8月のニュースレターが発行されました!今月は、「Quarkus 2.0がLinuxでの開発者の生産性を向上させる3つの理由」や「Bind a cloud event to Knative」などの素晴らしい記事をご覧ください。

source: The Authorization Code Flow mechanism authenticates users of your web application by redirecting them to an OIDC provider, such as Keycloak, to log in. After authentication, the OIDC provider redirects the user back to the application with an authorization code that confirms that authentication was successful. Then, the application exchanges this code with the OIDC provider for an ID token (which represents the authenticated user), an access token, and a refresh token to authorize the user's access to the application.
ja_jp: このエクステンションは、OpenID Connect Provider (例: Keycloak) にリダイレクトしてログインさせ、認証が完了したら、認証に成功したことを確認するコードを使って、ウェブアプリケーションのユーザーを簡単に認証することができます。エクステンションは、認可コードグラントを使用して OpenID Connect Provider から ID とアクセストークンを要求し、アプリケーションへのアクセスを承認するためにこれらのトークンを検証します。

source: The Authorization Code Flow mechanism redirects the user to an OIDC provider to authenticate the user's identity. After the user is redirected back to Quarkus, the mechanism completes the authentication process by exchanging the provided code that was granted for the ID, access, and refresh tokens.
ja_jp: 認可コードフローメカニズムは、ユーザーを OIDC プロバイダーにリダイレクトして、ユーザーのアイデンティティーを認証します。 ユーザーが Quarkus にリダイレクトされた後、メカニズムにより ID、アクセストークン、およびリフレッシュトークンに付与された提供コードを交換して認証プロセスを完了します。

source: The Avro support in native is still experimental. In the last Quarkus version, we made significant progress, but there may be some uncovered areas. Let us know if you find anything https://github.com/quarkusio/quarkus/issues/new/choose[odd]!
ja_jp: ネイティブでのAvroサポートはまだ実験的なものです。前回のQuarkusバージョンでは、かなりの進歩を遂げましたが、いくつかの未発見の部分があるかもしれません。 https://github.com/quarkusio/quarkus/issues/new/choose[何かおかしな点を見つけましたら教えてください] !

source: The Azure Functions `host.json` deployment descriptor is automatically generated, but if you need to override it, declare it in the root directory of the project and rerun the build when you are ready.
ja_jp: Azure Functions の`host.json`デプロイメント記述子は自動的に 生成されますが、オーバーライドする必要がある場合は、プロジェクトの root ディレクトリーで宣言し、 準備ができたらビルドを再実行します。

source: The BackgroundFunction
ja_jp: BackgroundFunction

source: The Basic Authentication mechanism does not provide confidentiality protection for the transmitted credentials. The credentials are merely encoded with Base64 when in transit and not encrypted or hashed in any way. Therefore, Basic Authentication is used with HTTPS to provide confidentiality.
ja_jp: Basic 認証の仕組みは、送信されるクレデンシャルに対して機密性の保護を提供しません。クレデンシャルは転送中にBase64でエンコードされるだけで、暗号化もハッシュ化もされません。したがって、Basic 認証は機密性を提供するために HTTPS と共に使用されます。

source: The Basic authentication mechanism does not provide confidentiality protection for the transmitted credentials. The credentials are merely encoded with Base64 when in transit, and not encrypted or hashed in any way. Therefore, to provide confidentiality, use Basic authentication with HTTPS.
ja_jp: Basic認証メカニズムは、送信されるクレデンシャルの機密性保護を提供しません。 クレデンシャルは転送時に Base64 でエンコードされるだけで、暗号化もハッシュ化もされません。 したがって、機密性を提供するには、 https で Basic 認証を使用してください。

source: The Batch API and Runtime will be available out of the box. Please refer to the <a href="#">Batch documentation</a>, or the <a href="#">JBeret documentation</a> to learn about Batch Applications.
ja_jp: Batch API と Runtime は、すぐに利用可能です。Batch アプリケーションについて学ぶには、<a href="#">Batch ドキュメント</a> または <a href="#">JBeret ドキュメント</a>を参照してください。

source: The Batch API requires the @BatchProperty annotation to inject the specific configuration from the batch definition file. Instead, you can use the @ConfigProperty annotation, which is used to inject configuration properties in Quarkus using the MicroProfile Config API and keep consistency:
ja_jp: Batch API は、バッチ定義ファイルから特定のコンフィグレーションを注入するために @BatchProperty アノテーションを必要とします。代わりに、Quarkus で MicroProfile Config API を使用して設定プロパティーを注入し、一貫性を保つために @ConfigProperty アノテーションを使用できます。

source: The Batch APIs JobOperator and JobRepository are available as CDI beans, so they can be injected directly into any code:
ja_jp: Batch API の JobOperator と JobRepository は CDI Bean として利用できるため、任意のコードに直接注入できます。

source: The Blue and Red services
ja_jp: ブルーサービスとレッドサービス

source: The CDI (ArC) context
ja_jp: CDI(ArC)のコンテキスト

source: The CDI Lite specification is fully supported. The following features from CDI Full are also supported:
ja_jp: CDI Lite 仕様は完全にサポートされています。 CDI Full の次の機能もサポートされています。

source: The CDI bean implementing the `KeyStoreProvider` interface can be `@ApplicationScoped`, `@Singleton` or `@Dependent`.
ja_jp: `KeyStoreProvider` インターフェイスを実装する CDI Bean は、`@ApplicationScoped`、`@Singleton`、または `@Dependent` にすることができます。

source: The CDI bean implementing the `KeyStoreProvider` interface can be `@ApplicationScoped`, `@Singleton`, or `@Dependent`.
ja_jp: `KeyStoreProvider` インターフェイスを実装する CDI Bean は、`@ApplicationScoped`、`@Singleton`、または `@Dependent` にすることができます。

source: The CDI bean implementing the `TrustStoreProvider` interface can be `@ApplicationScoped`, `@Singleton` or `@Dependent`.
ja_jp: `TrustStoreProvider` インターフェイスを実装する CDI Bean は、`@ApplicationScoped`、`@Singleton`、または `@Dependent` にすることができます。

source: The CDI bean that implements the `TrustStoreProvider` interface can be `@ApplicationScoped`, `@Singleton`, or `@Dependent`.
ja_jp: `TrustStoreProvider` インターフェイスを実装する CDI Bean は、`@ApplicationScoped`、`@Singleton`、または `@Dependent` にすることができます。

source: The CDI beans implementing `HttpUpgradeCheck` interface can be either `@ApplicationScoped`, `@Singleton` or `@Dependent` beans, but never the `@RequestScoped` beans.
ja_jp: `HttpUpgradeCheck` インターフェイスを実装する CDI Bean は、 `@ApplicationScoped`、 `@Singleton`、または `@Dependent` Bean のいずれかになりますが、 `@RequestScoped` Bean になることはできません。

source: The CDI layer processes CDI beans that are either explicitly registered or that it discovers based on bean defining annotations as defined in https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#bean_defining_annotations[2.5.1. Bean defining annotations]. You can expand this set of annotations to include annotations your extension processes using a `BeanDefiningAnnotationBuildItem` as shown in this `TestProcessor#registerBeanDefinningAnnotations` example:
ja_jp: CDI レイヤーは、明示的に登録されているか、 https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#bean_defining_annotations[2.5.1. Bean 定義アノテーション] で定義されている Bean 定義アノテーションに基づいて検出する CDI Bean を処理します。このアノテーションセットを拡張し、 `TestProcessor#registerBeanDefinningAnnotations` の例が示すように `BeanDefiningAnnotationBuildItem` を使用してエクステンションプロセスにアノテーションを含めることができます。

source: The CDI layer processes CDI beans that are either explicitly registered or that it discovers based on bean defining annotations as defined in https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#bean_defining_annotations[2.5.1. Bean defining annotations]. You can expand this set of annotations to include annotations your extension processes using a `BeanDefiningAnnotationBuildItem` as shown in this `TestProcessor#registerBeanDefinningAnnotations` example:
ja_jp: CDI レイヤーは、明示的に登録されているか、 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#bean_defining_annotations[2.5.1. Bean 定義アノテーション] で定義されている Bean 定義アノテーションに基づいて検出する CDI Bean を処理します。このアノテーションセットを拡張し、 `TestProcessor#registerBeanDefinningAnnotations` の例が示すように `BeanDefiningAnnotationBuildItem` を使用してエクステンションプロセスにアノテーションを含めることができます。

source: The CDI name of the function class must match the value specified within the `quarkus.google-cloud-functions.function` property. This must be done using the `@Named` annotation.
ja_jp: Cloud Functions の関数となるクラスの CDI 名は、 `quarkus.google-cloud-functions.function` プロパティー内で指定された値と一致している必要があります。これは `@Named` アノテーションを使用して行う必要があります。

source: The CDI name of the handler class must match the value specified within the `quarkus.lambda.handler` property.
ja_jp: ハンドラークラスのCDI名は、 `quarkus.lambda.handler` プロパティー内で指定された値と一致しなければなりません。

source: The CDI portable extension model is very flexible. Too flexible to benefit from the build time boot promoted by Quarkus. Most extension we have seen do not make use of these extreme flexibility capabilities. The way to port a CDI extension to Quarkus is to rewrite it as a Quarkus extension which will define the various beans at build time (deployment time in extension parlance).
ja_jp: CDIポータブルエクステンションモデルは非常に柔軟性が高いです。Quarkusが推進するビルドタイムブートの恩恵を受けるには、あまりにも柔軟性が高すぎます。私たちが見てきたほとんどのエクステンションは、このような極端な柔軟性の機能を利用していません。CDIエクステンションをQuarkusに移植する方法は、ビルド時（エクステンションの言い方ではデプロイ時）に様々なBeanを定義するQuarkusエクステンションとして書き換えることです。

source: The CDI request context activation shown in the example above does not help you to access the `RoutingContext` when the proactive authentication is enabled. The following example illustrates how you can access the `RoutingContext` from the `SecurityIdentityAugmentor`:
ja_jp: プロアクティブ認証が有効な場合、上記の例で示したCDIリクエストコンテキストのアクティブ化は、 `RoutingContext` へのアクセスには役立ちません。 次の例は、 `SecurityIdentityAugmentor` から `RoutingContext` にアクセスする方法を示しています：

source: The CSRF prevention filter applies to requests using HTTP `POST`, `PUT`, `PATCH`, `DELETE` and other methods that can change the REST application state.
ja_jp: CSRF 防止フィルターは、HTTP `POST`、`PUT`、`PATCH`、`DELETE`、および REST アプリケーションの状態を変更できるその他のメソッドを使用するリクエストに適用されます。

source: The Cache extension supports building native executables.
ja_jp: Cache エクステンションは、ネイティブ実行可能ファイルの構築をサポートしています。

source: The Camel team is doing an update to have log4j removed from this Maven repository zip file. Something you as a user of Quarkus or Camel Quarkus will not be affected by.
ja_jp: Camelチームは、このMavenリポジトリのZIPファイルからlog4jを削除するためのアップデートを行います。QuarkusまたはCamel Quarkusのユーザーとして、影響を受けることはありません。

source: The Cassandra Quarkus client can provide metrics about the Cassandra session and about individual Cassandra nodes. It supports both Micrometer and MicroProfile.
ja_jp: Cassandra Quarkus クライアントは、Cassandra セッションおよび個々の Cassandra ノードに関するメトリクスを提供できます。このクライアントは、Micrometer と MicroProfile の両方をサポートします。

source: The Cassandra Quarkus extension allows you to inject any of the following beans in your own components:
ja_jp: Cassandra Quarkus エクステンションを使用すると、次の Bean のいずれかを独自のコンポーネントに挿入できます。

source: The Cassandra driver uses the Reactive Streams `Publisher` API for reactive calls. The Quarkus framework however uses Mutiny. Because of that, the `CqlQuarkusSession` interface transparently converts the `Publisher` instances returned by the driver into the reactive type `Multi`. `CqlQuarkusSession` is also capable of converting a `Publisher` into a `Uni` – in this case, the publisher is expected to emit at most one row, then complete. This is suitable for write queries (they return no rows), or for read queries guaranteed to return one row at most (count queries, for example).
ja_jp: Cassandraドライバは、リアクティブコールにReactive Streamsの `Publisher` APIを使用しています。しかし、QuarkusフレームワークではMutinyを使用しています。そのため、 `CqlQuarkusSession` インターフェイスは、ドライバが返す `Publisher` インスタンスを透過的にリアクティブ型の `Multi` に変換します。 `CqlQuarkusSession` は `Publisher` を `Uni` に変換することもできます - この場合、パブリッシャーは最大で1行を出力し、その後完了することが期待されます。これは書き込みクエリ(行を返さない)や、最大で1行を返すことが 保証されている読み込みクエリ(例えばカウントクエリ)に適しています。

source: The Cassandra driver uses the Reactive Streams `Publisher` API for reactive calls. The Quarkus framework, however uses Mutiny. Because of that, the `CqlQuarkusSession` interface transparently converts the `Publisher` instances returned by the driver into the reactive type `Multi`. `CqlQuarkusSession` is also capable of converting a `Publisher` into a `Uni` – in this case, the publisher is expected to emit at most one row, then complete. This is suitable for write queries (they return no rows), or for read queries guaranteed to return one row at most (count queries, for example).
ja_jp: Cassandra ドライバーは、リアクティブ呼び出しに Reactive Streams の `Publisher` API を使用します。しかし、Quarkus フレームワークは Mutiny を使用します。そのため、`CqlQuarkusSession` インターフェースは、ドライバーが返す `Publisher` インスタンスをリアクティブ型 `Multi` に透過的に変換します。`CqlQuarkusSession` は `Publisher` を `Uni` に変換することもできます。この場合、パブリッシャーは最大 1 行を出力し、その後完了することが期待されます。これは、書き込みクエリ（行を返さない）や、最大 1 行を返すことが保証されている読み取りクエリ（例えばカウントクエリ）に適しています。

source: The Cassandra extension: exposes an imperative and reactive (Mutiny) APIs to interact with Cassandra
ja_jp: Cassandraエクステンション: Cassandraと対話するための命令型およびリアクティブ型（Mutiny）のAPIを公開しています。

source: The Challenge
ja_jp: 挑戦

source: The Class Loading model for testing is now the same as development mode (as tests need to be hot reloaded), if this causes issues for your application you can set `quarkus.test.flat-class-path=true` to revert to the old model, but it will disable continuous testing.
ja_jp: テスト用のクラス・ローディング・モデルは、開発モードと同じになりました（テストはホット・リロードが必要なため）。もしこのモデルがアプリケーションに問題を起こすようであれば、 `quarkus.test.flat-class-path=true` を設定して古いモデルに戻すことができますが、継続的なテストは無効になります。

source: The Client uses `client_credentials` that requires client ID and secret or password grant, which also requires client ID, secret, user name, and password to retrieve the access token from the OpenID Connect provider.
ja_jp: クライアントは、OpenID Connectプロバイダからアクセストークンを取得するために、クライアントIDとシークレットを必要とする `client_credentials` 、またはクライアントID、シークレット、ユーザー名、パスワードも必要とするpassword grantを使用します。

source: The Client uses the access token to retrieve the service data from the Quarkus service.
ja_jp: クライアントはアクセストークンを使用して、Quarkusサービスからサービスデータを取得します。

source: The Cloud Event link:https://cloudevents.io/[specification] is a good read to give you an even greater understanding of Knative Events.
ja_jp: Knative Events をより深く理解するために、Cloud Events の link:https://cloudevents.io/[仕様] を読んでおくと良いでしょう。

source: The Cloud Event mode (`structured` or `binary` (default)). Indicates how are written the cloud events in the outgoing record Type: _string_
ja_jp: Cloud Eventのモード（ `structured` または `binary` （デフォルト））。outgoing レコードにCloud Eventをどのように書き込むかを示します タイプ: _string_

source: The Cloud Event mode (`structured` or `binary` (default)). Indicates how the cloud events are written in the outgoing record Type: _string_
ja_jp: Cloud Event モード (`structured` または `binary` (デフォルト))。送信レコードにおける Cloud Event の書き込み方法を指定します。 Type: _string_

source: The CloudEventsFunction
ja_jp: CloudEventsFunction

source: The CoT architecture starts with a "User Query" that initiates the process. This query is received by the "Quarkus CoT Service," which serves as the orchestrator for the entire reasoning flow. Within the Quarkus service, the core Chain-of-Thought logic, powered by LangChain4j, is executed.
ja_jp: CoT アーキテクチャは、プロセスを開始する「ユーザー クエリ」から始まります。このクエリは、「Quarkus CoT サービス」によって受信され、このサービスが推論フロー全体のオーケストレーターとして機能します。Quarkus サービス内で、LangChain4j を活用したコアの Chain-of-Thought ロジックが実行されます。

source: The Code
ja_jp: コード

source: The CodeStarts project has been a long and steady effort. Good news: it is now the default project generation tool.
ja_jp: CodeStarts プロジェクトは、長い間地道な努力を続けてきました。朗報:今はデフォルトのプロジェクト生成ツールになりました。

source: The Codestart (Quarkiverse or Standalone extensions)
ja_jp: Codestart (Quarkiverse またはスタンドアロンエクステンション)

source: The Commons Logging adapter is provided by the following dependency:
ja_jp: Commons Logging アダプターは、以下の依存関係によって提供されます。

source: The Continuation Dance
ja_jp: 継続的な動作

source: The Credentials Provider is not used when `quarkus.proxy.password` (for global) or `quarkus.proxy.<named>.password` (for named) is not set.
ja_jp: `quarkus.proxy.password` (グローバル用) または `quarkus.proxy.<named>.password` (名前付き用) が設定されていない場合、Credentials Provider は使用されません。

source: The CredentialsProvider bean name
ja_jp: CredentialsProvider Bean の名前

source: The Database Dev Services supports xref:compose-dev-services.adoc[Compose Dev Services]. It relies on a `compose-devservices.yml`, such as:
ja_jp: Database Dev Services は xref:compose-dev-services.adoc[Compose Dev Services] をサポートしています。 これは、次のような `compose-devservices.yml` に依存します:

source: The December Newsletter has been published! This month, you can find articles about; testing a Quarkus Kafka application, exploring Java 17 features with Quarkus, Quarkus bean discovery with Jandex indexing, automating Quarkus with Gitlab, boosting throughput with RESTEasy Reactive in Quarkus 2.2, and Azure resources operator with Quarkus.
ja_jp: 12月のニュースレターが発行されました。今月は、Quarkus Kafkaアプリケーションのテスト、QuarkusでのJava 17機能の探求、JandexインデックスによるQuarkus Beanの発見、GitlabによるQuarkusの自動化、Quarkus 2.2でのRESTEasy Reactiveによるスループットの向上、QuarkusでのAzureリソースオペレーターに関する記事が掲載されています。

source: The Default
ja_jp: デフォルト

source: The Deployment module
ja_jp: Deployment モジュール

source: The Dev Assistant can help with:
ja_jp: Dev Assistant は以下のことをサポートします:

source: The Dev Assistant integrates seamlessly into various parts of the Dev UI. Wherever assistant features are available, they are highlighted using a distinctive *pink theme*, making it easy to spot AI-powered interactions.
ja_jp: Dev Assistant は Dev UI のさまざまな部分にシームレスに統合されています。アシスタント機能が利用可能な場所は、特徴的な *ピンク色のテーマ* でハイライトされており、 AI 駆動のインタラクションを簡単に見つけることができます。

source: The Dev Assistant is evolving! If it gives incorrect answers or misses something obvious, please report it at:
ja_jp: Dev Assistant は進化を続けています。誤った回答をしたり、明らかなことを見落としたりした場合は、以下で報告してください。

source: The Dev Service includes a set of dashboards.
ja_jp: Dev Service にはダッシュボードのセットが含まれています。

source: The Dev UI experience described in the <<keycloak-authorization-code-grant,Authorization code grant for Keycloak>> section might differ slightly if you work with other providers. For example, an access token might not be in JWT format, so it would not be possible to show its internal content. However, all providers should return ID tokens in the JWT format.
ja_jp: 他のプロバイダーを使用している場合、<<keycloak-authorization-code-grant,Authorization code grant for Keycloak>> で説明されている Dev UI のエクスペリエンスが若干異なる場合があります。 たとえば、アクセストークンが JWT 形式でない場合、その内部コンテンツを表示できません。 ただし、すべてのプロバイダーが JWT 形式で ID トークンを返すはずです。

source: The Dev UI for all OpenID Connect providers is activated if the following conditions are met:
ja_jp: 以下の条件を満たす場合、すべての OpenID Connect プロバイダーの Dev UI が有効になります：

source: The Dev UI is available in dev mode only (e.g. `mvn quarkus:dev`) and accessible at the `/q/dev` endpoint by default.
ja_jp: Dev UI は開発モードでのみ利用可能で(例: `mvn quarkus:dev` )、デフォルトでは `/q/dev` エンドポイントからアクセスできます。

source: The Dev UI is designed to boost developer joy by making Quarkus' inner workings observable and extensible. It offers:
ja_jp: Dev UI は、Quarkus の内部動作を観測可能で拡張可能にすることで、開発者の喜びを高めるように設計されています。それは以下を提供します:

source: The Dev UI is not available when running in continuous testing mode, as this is provided by dev mode.
ja_jp: Dev UIは開発モードで提供されているため、継続的テストモードで実行している場合は利用できません。

source: The Dev UI is now internationalized.
ja_jp: Dev UIが国際化されました。

source: The Dev UI view is very basic, it will be improved for the next release
ja_jp: Dev UIビューは非常に基本的なものですが、次のリリースでは改善される予定です

source: The Docker registry can be specified with the following property:
ja_jp: Docker レジストリーは、以下のプロパティーで指定できます。

source: The Elasticsearch Dev Service will be enabled when one of the Elasticsearch based extensions (Elasticsearch client or Hibernate Search ORM Elasticsearch) is present in your application, and the server address has not been explicitly configured. More information can be found at the xref:elasticsearch-dev-services.adoc[Elasticsearch Dev Services Guide].
ja_jp: Redis Dev Serviceは、アプリケーションに `quarkus-redis-client` エクステンションが存在し、サーバー・アドレスが明示的に設定されていない場合に有効になります。詳細は、 link:redis-dev-services.html[Redis Dev Services Guide]をご覧ください。

source: The Elasticsearch Dev Service will be enabled when one of the Elasticsearch based extensions (Elasticsearch client or Hibernate Search ORM Elasticsearch) is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:elasticsearch-dev-services.adoc[Elasticsearch Dev Services Guide].
ja_jp: Redis Dev Serviceは、アプリケーションに `quarkus-redis-client` エクステンションが存在し、サーバー・アドレスが明示的に設定されていない場合に有効になります。詳細は、 link:redis-dev-services.html[Redis Dev Services ガイド]を参照してください。

source: The Elasticsearch Java client
ja_jp: Elasticsearch Java クライアント

source: The Elasticsearch low level REST client comes with the `quarkus-elasticsearch-rest-client` extension that has been added to your build file.
ja_jp: Elasticsearch low level REST client は、ビルドファイルに追加された `quarkus-elasticsearch-rest-client` エクステンションに付属しています。

source: The Envers extension to Hibernate ORM aims to provide an easy auditing / versioning solution for entity classes.
ja_jp: Hibernate ORMのEnversエクステンションは、エンティティクラスのための簡単な監査/バージョン管理ソリューションを提供することを目的としています。

source: The Event Hub connection string given by Azure.
ja_jp: Azure が提供する Event Hub 接続文字列。
